
## Plan Result (dev)

[CI link](https://github.com/fumi-mura/tfaction-sample/actions/runs/17854412568)

It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
09:31:22.775 STDOUT terraform: data.aws_caller_identity.current: Reading...
09:31:22.775 STDOUT terraform: module.cwlogs1.aws_cloudwatch_log_group.this: Refreshing state... [id=test-2]
09:31:22.922 STDOUT terraform: data.aws_caller_identity.current: Read complete after 0s [id=598981015011]
09:31:22.924 STDOUT terraform: module.init.data.aws_iam_policy_document.assume_role: Reading...
09:31:22.925 STDOUT terraform: module.init.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=1699744044]
09:31:22.927 STDOUT terraform: module.init.aws_iam_role.this["plan_admin"]: Refreshing state... [id=dev-iam-role-terraform-plan-readonly]
09:31:22.927 STDOUT terraform: module.init.aws_iam_role.this["apply_admin"]: Refreshing state... [id=dev-iam-role-terraform-apply-admin]
09:31:23.204 STDOUT terraform: module.init.aws_iam_role_policy_attachment.this["apply_admin"]: Refreshing state... [id=dev-iam-role-terraform-apply-admin/arn:aws:iam::aws:policy/AdministratorAccess]
09:31:23.205 STDOUT terraform: module.init.aws_iam_role_policy_attachment.this["plan_admin"]: Refreshing state... [id=dev-iam-role-terraform-plan-readonly/arn:aws:iam::aws:policy/ReadOnlyAccess]
09:31:23.706 STDOUT terraform: Terraform used the selected providers to generate the following execution
09:31:23.706 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
09:31:23.706 STDOUT terraform:   + create
09:31:23.706 STDOUT terraform: -/+ destroy and then create replacement
09:31:23.706 STDOUT terraform: Terraform will perform the following actions:
09:31:23.706 STDOUT terraform:   # module.cwlogs1.aws_cloudwatch_log_group.this must be replaced
09:31:23.706 STDOUT terraform: -/+ resource "aws_cloudwatch_log_group" "this" {
09:31:23.706 STDOUT terraform:       ~ arn               = "arn:aws:logs:ap-northeast-1:598981015011:log-group:test-2" -> (known after apply)
09:31:23.706 STDOUT terraform:       ~ id                = "test-2" -> (known after apply)
09:31:23.706 STDOUT terraform:       ~ log_group_class   = "STANDARD" -> (known after apply)
09:31:23.706 STDOUT terraform:       ~ name              = "test-2" -> "test1" # forces replacement
09:31:23.706 STDOUT terraform:       + name_prefix       = (known after apply)
09:31:23.706 STDOUT terraform:       - tags              = {} -> null
09:31:23.706 STDOUT terraform:         # (5 unchanged attributes hidden)
09:31:23.706 STDOUT terraform:     }
09:31:23.706 STDOUT terraform:   # module.cwlogs2.aws_cloudwatch_log_group.this will be created
09:31:23.706 STDOUT terraform:   + resource "aws_cloudwatch_log_group" "this" {
09:31:23.706 STDOUT terraform:       + arn               = (known after apply)
09:31:23.706 STDOUT terraform:       + id                = (known after apply)
09:31:23.706 STDOUT terraform:       + log_group_class   = (known after apply)
09:31:23.706 STDOUT terraform:       + name              = "test2"
09:31:23.706 STDOUT terraform:       + name_prefix       = (known after apply)
09:31:23.707 STDOUT terraform:       + region            = "ap-northeast-1"
09:31:23.707 STDOUT terraform:       + retention_in_days = 30
09:31:23.707 STDOUT terraform:       + skip_destroy      = false
09:31:23.707 STDOUT terraform:       + tags_all          = {
09:31:23.707 STDOUT terraform:           + "Environment"        = "dev"
09:31:23.707 STDOUT terraform:           + "ManagedByTerraform" = "true"
09:31:23.707 STDOUT terraform:           + "ServiceName"        = "tfaction-sample"
09:31:23.707 STDOUT terraform:         }
09:31:23.707 STDOUT terraform:     }
09:31:23.707 STDOUT terraform: Plan: 2 to add, 0 to change, 1 to destroy.
09:31:23.707 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
09:31:23.707 STDOUT terraform: Saved the plan to:
09:31:23.707 STDOUT terraform: ./tfplan.binary
09:31:23.707 STDOUT terraform: To perform exactly these actions, run the following command to apply:
09:31:23.707 STDOUT terraform:     terraform apply "./tfplan.binary"

```

</details>

<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":18,"Program":"tfcmt","SHA1":"120a6962272f8e888868c015c97a5216e043ea65","Target":"dev","Vars":{},"WorkflowName":"Terraform plan"} -->